In [ ]:
mysql -u root -p

#creating database
CREATE DATABASE school;

#using that database
USE school;

#creating a table & defining rows
CREATE TABLE students (
    id INT,
    name VARCHAR(50),
    rollno INT
);

#Inserting data into table
INSERT INTO students VALUES (1, "rollno", 21);
SELECT * FROM students;

#printing it

SELECT * FROM students WHERE id = 1;

In [ ]:
#creating a new table called 'class'
CREATE TABLE class (
    id INT,
    name VARCHAR(50),
    age INT,
    course VARCHAR(50),
    marks INT
);
insert into class values( 1, "Manish" , 18, "SQL", 78); #inserting values just 1
insert into class values( 2, "Shivashish" , 20, "SQL", 98), (3, "Srijan", 20, "SQL", 95), (4, "Ayush", 20, "SQL", 92); #inserting multiple values
SELECT * FROM class;
SELECT name, marks FROM class;
SELECT * FROM class ORDER BY marks DESC; #descend
SELECT * FROM class ORDER BY marks ASC; #ascend
SELECT * FROM class WHERE marks > 90;
SELECT AVG(marks) FROM class;
SELECT MIN(marks) FROM class;
SELECT COUNT(*) FROM class;
#OrderBy -> Sorting
#Sum(marks) -> Sum of marks
#AVG(makrs) -> Avg marks
SELECT marks FROM class WHERE id = 2 AND marks = 98;
DELETE FROM class WHERE id=3;
SELECT * FROM class ORDER BY marks ASC LIMIT 2;#printing the top
UPDATE class SET marks=33 where id=1;

SyntaxError: invalid syntax (ipython-input-2210186260.py, line 2)

***DELETE:*** Only one deleted data deleted

***TRUNCATE:*** Only data deleted but we have table exists, TRUNCATE TABLE class;

***DROP:*** Whole table deleted from database, DROP TABLE class;

In [ ]:
select * from class;
select course, avg(marks) from class group by course;
update class set course="python" where marks = 98;
update class set course="java" where marks = 92;
update class set course="c++" where marks = 75;
update class set course="DSA" where marks = 50;
select course, avg(marks) from class group by course;
select avg(marks), max(marks) from class group by age;
select avg(marks), max(marks) from class group by age,course;

In [ ]:
#Give me average age and minimum marks by name and id
select name, id, avg(age), min(marks) from class group by name, id;

In [ ]:
CREATE DATABSE employees;

CREATE TABLE employees (
    emp_id INT,
    emp_name VARCHAR(50),
    department VARCHAR(30),
    gender VARCHAR(10),
    city VARCHAR(30),
    salary INT,
    experience INT
);

INSERT INTO employees VALUES
(1, 'Rahul', 'IT', 'Male', 'Delhi', 70000, 5),
(2, 'Anita', 'HR', 'Female', 'Mumbai', 50000, 4),
(3, 'Aman', 'IT', 'Male', 'Delhi', 90000, 8),
(4, 'Neha', 'Finance', 'Female', 'Pune', 60000, 6),
(5, 'Rohit', 'IT', 'Male', 'Mumbai', 75000, 5),
(6, 'Priya', 'HR', 'Female', 'Delhi', 48000, 3),
(7, 'Vikas', 'Finance', 'Male', 'Pune', 65000, 7),
(8, 'Sneha', 'IT', 'Female', 'Bangalore', 85000, 6),
(9, 'Arjun', 'HR', 'Male', 'Mumbai', 52000, 4),
(10,'Kavya', 'Finance', 'Female', 'Delhi', 72000, 8);

select * from class employees;

select department, avg(salary) from employees group by department;
select department, avg(salary) from employees group by department having avg(salary) > 60000;
select city, sum(salary) from employees group by city;
select department, count(*) from employees where salary > 60000 group by department;
select gender, max(salary) from employees group by gender;
elect department, city, avg(salary) from employees group by department,city;
select department, count(*) as male_count from employees where gender = 'Male' group by department;
select department, gender, Max(salary) from employees group by department, gender;